simulations/expanded_domain/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	// Verticies for outer mesh
	(-6.0 -10.1250 0.000) // Vertex 0
	(-1.0 -10.1250 0.000) // Vertex 1
	(-1.0  0.0000 0.000) // Vertex 2
	(-6.0  0.0000 0.000) // Vertex 3
	( 0.0 -10.1250 0.000) // Vertex 4
	( 0.0 -0.1250 0.000) // Vertex 5
	( 1.0 -10.1250 0.000) // Vertex 6
	( 1.0  0.0000 0.000) // Vertex 7
	(30.0 -10.1250 0.000) // Vertex 8
	(30.0  0.0000 0.000) // Vertex 9
	(30.0  10.1250 0.000) // Vertex 10
	( 1.0  10.1250 0.000) // Vertex 11
	( 0.0  0.1250 0.000) // Vertex 12
	( 0.0  10.1250 0.000) // Vertex 13
	(-1.0  10.1250 0.000) // Vertex 14
	(-6.0  10.1250 0.000) // Vertex 15
	(-6.0 -10.1250 0.500) // Vertex 16
	(-1.0 -10.1250 0.500) // Vertex 17
	(-1.0  0.0000 0.500) // Vertex 18
	(-6.0  0.0000 0.500) // Vertex 19
	( 0.0 -10.1250 0.500) // Vertex 20
	( 0.0 -0.1250 0.500) // Vertex 21
	( 1.0 -10.1250 0.500) // Vertex 22
	( 1.0  0.0000 0.500) // Vertex 23
	(30.0 -10.1250 0.500) // Vertex 24
	(30.0  0.0000 0.500) // Vertex 25
	(30.0  10.1250 0.500) // Vertex 26
	( 1.0  10.1250 0.500) // Vertex 27
	( 0.0  0.1250 0.500) // Vertex 28
	( 0.0  10.1250 0.500) // Vertex 29
	(-1.0  10.1250 0.500) // Vertex 30
	(-6.0  10.1250 0.500) // Vertex 31

	// Verticies for ellipse
	( 0.0 -0.0625 0.000) // Vertex 32
	(-0.5  0.0000 0.000) // Vertex 33
	( 0.5  0.0000 0.000) // Vertex 34
	( 0.0  0.0625 0.000) // Vertex 35
	( 0.0 -0.0625 0.500) // Vertex 36
	(-0.5  0.0000 0.500) // Vertex 37
	( 0.5  0.0000 0.500) // Vertex 38
	( 0.0  0.0625 0.500) // Vertex 39
	
); 

blocks
(
	// Blocks for outer mesh
	hex (16 17  1  0 19 18  2  3) ( 80 1 40) simpleGrading (1 1 1) // Block 0
	hex (17 20  4  1 18 21  5  2) ( 80 1 40) simpleGrading (1 1 1) // Block 1
	hex (20 22  6  4 21 23  7  5) ( 80 1 40) simpleGrading (1 1 1) // Block 2
	hex (22 24  8  6 23 25  9  7) (160 1 40) simpleGrading (1 1 1) // Block 3
	hex (23 25  9  7 27 26 10 11) (160 1 40) simpleGrading (1 1 1) // Block 4
	hex (28 23  7 12 29 27 11 13) ( 80 1 40) simpleGrading (1 1 1) // Block 5
	hex (18 28 12  2 30 29 13 14) ( 80 1 40) simpleGrading (1 1 1) // Block 6
	hex (19 18  2  3 31 30 14 15) ( 80 1 40) simpleGrading (1 1 1) // Block 7
	
	// Blocks for ellipse 
	hex (18 21  5  2 37 36 32 33) (80 1 30) simpleGrading (1 1 1) // Block 8 // Good block oriented strangely
	hex (21 23  7  5 36 38 34 32) (80 1 30) simpleGrading (1 1 1) // Block 9 // Good block!
	hex (23 28 12  7 38 39 35 34) (80 1 30) simpleGrading (1 1 1) // Block 10 // Good block!
	hex (28 18  2 12 39 37 33 35) (80 1 30) simpleGrading (1 1 1) // Block 11 // Good block!
);

edges
(
	//Curved edges for inner ellipse
	spline 37 39 ((-0.5 0.0 0.5) (-0.45454545454545453 0.026037361903158189 0.5) (-0.40909090909090906 0.035934973411004316 0.5) (-0.36363636363636365 0.04289678656403835 0.5) (-0.31818181818181818 0.04821182598999188 0.5) (-0.27272727272727271 0.052383775325527772 0.5) (-0.22727272727272729 0.055670221426890411 0.5) (-0.18181818181818182 0.058221311170224992 0.5) (-0.13636363636363635 0.060130711615104332 0.5) (-0.090909090909090884 0.061458260377227091 0.5) (-0.045454545454545414 0.062241199716496151 0.5) (0.0 0.0625 0.5))
	spline 37 36 ((-0.5 -0 0.5) (-0.45454545454545453 -0.026037361903158189 0.5) (-0.40909090909090906 -0.035934973411004316 0.5) (-0.36363636363636365 -0.04289678656403835 0.5) (-0.31818181818181818 -0.04821182598999188 0.5) (-0.27272727272727271 -0.052383775325527772 0.5) (-0.22727272727272729 -0.055670221426890411 0.5) (-0.18181818181818182 -0.058221311170224992 0.5) (-0.13636363636363635 -0.060130711615104332 0.5) (-0.090909090909090884 -0.061458260377227091 0.5) (-0.045454545454545414 -0.062241199716496151 0.5) (0.0 -0.0625 0.5))
	spline 39 38 ((0.0 0.0625 0.5) (0.045454545454545456 0.062241199716496151 0.5) (0.090909090909090912 0.061458260377227091 0.5) (0.13636363636363635 0.060130711615104332 0.5) (0.18181818181818182 0.058221311170224992 0.5) (0.22727272727272729 0.055670221426890411 0.5) (0.27272727272727271 0.052383775325527772 0.5) (0.31818181818181818 0.04821182598999188 0.5) (0.36363636363636365 0.04289678656403835 0.5) (0.40909090909090912 0.035934973411004302 0.5) (0.45454545454545459 0.026037361903158172 0.5) (0.5 0.0 0.5))
	spline 36 38 ((0.0 -0.0625 0.5) (0.045454545454545456 -0.062241199716496151 0.5) (0.090909090909090912 -0.061458260377227091 0.5) (0.13636363636363635 -0.060130711615104332 0.5) (0.18181818181818182 -0.058221311170224992 0.5) (0.22727272727272729 -0.055670221426890411 0.5) (0.27272727272727271 -0.052383775325527772 0.5) (0.31818181818181818 -0.04821182598999188 0.5) (0.36363636363636365 -0.04289678656403835 0.5) (0.40909090909090912 -0.035934973411004302 0.5) (0.45454545454545459 -0.026037361903158172 0.5) (0.5 -0 0.5))
	spline 33 35 ((-0.5 0.0 0.0) (-0.45454545454545453 0.026037361903158189 0.0) (-0.40909090909090906 0.035934973411004316 0.0) (-0.36363636363636365 0.04289678656403835 0.0) (-0.31818181818181818 0.04821182598999188 0.0) (-0.27272727272727271 0.052383775325527772 0.0) (-0.22727272727272729 0.055670221426890411 0.0) (-0.18181818181818182 0.058221311170224992 0.0) (-0.13636363636363635 0.060130711615104332 0.0) (-0.090909090909090884 0.061458260377227091 0.0) (-0.045454545454545414 0.062241199716496151 0.0) (0.0 0.0625 0.0))
	spline 33 32 ((-0.5 -0 0.0) (-0.45454545454545453 -0.026037361903158189 0.0) (-0.40909090909090906 -0.035934973411004316 0.0) (-0.36363636363636365 -0.04289678656403835 0.0) (-0.31818181818181818 -0.04821182598999188 0.0) (-0.27272727272727271 -0.052383775325527772 0.0) (-0.22727272727272729 -0.055670221426890411 0.0) (-0.18181818181818182 -0.058221311170224992 0.0) (-0.13636363636363635 -0.060130711615104332 0.0) (-0.090909090909090884 -0.061458260377227091 0.0) (-0.045454545454545414 -0.062241199716496151 0.0) (0.0 -0.0625 0.0))
	spline 35 34 ((0.0 0.0625 0.0) (0.045454545454545456 0.062241199716496151 0.0) (0.090909090909090912 0.061458260377227091 0.0) (0.13636363636363635 0.060130711615104332 0.0) (0.18181818181818182 0.058221311170224992 0.0) (0.22727272727272729 0.055670221426890411 0.0) (0.27272727272727271 0.052383775325527772 0.0) (0.31818181818181818 0.04821182598999188 0.0) (0.36363636363636365 0.04289678656403835 0.0) (0.40909090909090912 0.035934973411004302 0.0) (0.45454545454545459 0.026037361903158172 0.0) (0.5 0.0 0.0))
	spline 32 34 ((0.0 -0.0625 0.0) (0.045454545454545456 -0.062241199716496151 0.0) (0.090909090909090912 -0.061458260377227091 0.0) (0.13636363636363635 -0.060130711615104332 0.0) (0.18181818181818182 -0.058221311170224992 0.0) (0.22727272727272729 -0.055670221426890411 0.0) (0.27272727272727271 -0.052383775325527772 0.0) (0.31818181818181818 -0.04821182598999188 0.0) (0.36363636363636365 -0.04289678656403835 0.0) (0.40909090909090912 -0.035934973411004302 0.0) (0.45454545454545459 -0.026037361903158172 0.0) (0.5 -0 0.0))
	
	//Curved edges for outer ellipse
	spline 18 28 ((-1.0 0.0 0.5) (-0.90909090909090906 0.052074723806316378 0.5) (-0.81818181818181812 0.071869946822008632 0.5) (-0.72727272727272729 0.0857935731280767 0.5) (-0.63636363636363635 0.09642365197998376 0.5) (-0.54545454545454541 0.10476755065105554 0.5) (-0.45454545454545459 0.11134044285378082 0.5) (-0.36363636363636365 0.11644262234044998 0.5) (-0.27272727272727271 0.12026142323020866 0.5) (-0.18181818181818177 0.12291652075445418 0.5) (-0.090909090909090828 0.1244823994329923 0.5) (0.0 0.125 0.5))
	spline 18 21 ((-1.0 -0 0.5) (-0.90909090909090906 -0.052074723806316378 0.5) (-0.81818181818181812 -0.071869946822008632 0.5) (-0.72727272727272729 -0.0857935731280767 0.5) (-0.63636363636363635 -0.09642365197998376 0.5) (-0.54545454545454541 -0.10476755065105554 0.5) (-0.45454545454545459 -0.11134044285378082 0.5) (-0.36363636363636365 -0.11644262234044998 0.5) (-0.27272727272727271 -0.12026142323020866 0.5) (-0.18181818181818177 -0.12291652075445418 0.5) (-0.090909090909090828 -0.1244823994329923 0.5) (0.0 -0.125 0.5))
	spline 28 23 ((0.0 0.125 0.5) (0.090909090909090912 0.1244823994329923 0.5) (0.18181818181818182 0.12291652075445418 0.5) (0.27272727272727271 0.12026142323020866 0.5) (0.36363636363636365 0.11644262234044998 0.5) (0.45454545454545459 0.11134044285378082 0.5) (0.54545454545454541 0.10476755065105554 0.5) (0.63636363636363635 0.09642365197998376 0.5) (0.72727272727272729 0.0857935731280767 0.5) (0.81818181818181823 0.071869946822008604 0.5) (0.90909090909090917 0.052074723806316343 0.5) (1.0 0.0 0.5))
	spline 21 23 ((0.0 -0.125 0.5) (0.090909090909090912 -0.1244823994329923 0.5) (0.18181818181818182 -0.12291652075445418 0.5) (0.27272727272727271 -0.12026142323020866 0.5) (0.36363636363636365 -0.11644262234044998 0.5) (0.45454545454545459 -0.11134044285378082 0.5) (0.54545454545454541 -0.10476755065105554 0.5) (0.63636363636363635 -0.09642365197998376 0.5) (0.72727272727272729 -0.0857935731280767 0.5) (0.81818181818181823 -0.071869946822008604 0.5) (0.90909090909090917 -0.052074723806316343 0.5) (1.0 -0 0.5))
	spline  2 12 ((-1.0 0.0 0.0) (-0.90909090909090906 0.052074723806316378 0.0) (-0.81818181818181812 0.071869946822008632 0.0) (-0.72727272727272729 0.0857935731280767 0.0) (-0.63636363636363635 0.09642365197998376 0.0) (-0.54545454545454541 0.10476755065105554 0.0) (-0.45454545454545459 0.11134044285378082 0.0) (-0.36363636363636365 0.11644262234044998 0.0) (-0.27272727272727271 0.12026142323020866 0.0) (-0.18181818181818177 0.12291652075445418 0.0) (-0.090909090909090828 0.1244823994329923 0.0) (0.0 0.125 0.0))
	spline  2  5 ((-1.0 -0 0.0) (-0.90909090909090906 -0.052074723806316378 0.0) (-0.81818181818181812 -0.071869946822008632 0.0) (-0.72727272727272729 -0.0857935731280767 0.0) (-0.63636363636363635 -0.09642365197998376 0.0) (-0.54545454545454541 -0.10476755065105554 0.0) (-0.45454545454545459 -0.11134044285378082 0.0) (-0.36363636363636365 -0.11644262234044998 0.0) (-0.27272727272727271 -0.12026142323020866 0.0) (-0.18181818181818177 -0.12291652075445418 0.0) (-0.090909090909090828 -0.1244823994329923 0.0) (0.0 -0.125 0.0))
	spline 12  7 ((0.0 0.125 0.0) (0.090909090909090912 0.1244823994329923 0.0) (0.18181818181818182 0.12291652075445418 0.0) (0.27272727272727271 0.12026142323020866 0.0) (0.36363636363636365 0.11644262234044998 0.0) (0.45454545454545459 0.11134044285378082 0.0) (0.54545454545454541 0.10476755065105554 0.0) (0.63636363636363635 0.09642365197998376 0.0) (0.72727272727272729 0.0857935731280767 0.0) (0.81818181818181823 0.071869946822008604 0.0) (0.90909090909090917 0.052074723806316343 0.0) (1.0 0.0 0.0))
	spline  5  7 ((0.0 -0.125 0.0) (0.090909090909090912 -0.1244823994329923 0.0) (0.18181818181818182 -0.12291652075445418 0.0) (0.27272727272727271 -0.12026142323020866 0.0) (0.36363636363636365 -0.11644262234044998 0.0) (0.45454545454545459 -0.11134044285378082 0.0) (0.54545454545454541 -0.10476755065105554 0.0) (0.63636363636363635 -0.09642365197998376 0.0) (0.72727272727272729 -0.0857935731280767 0.0) (0.81818181818181823 -0.071869946822008604 0.0) (0.90909090909090917 -0.052074723806316343 0.0) (1.0 -0 0.0))
	
);

boundary
(

	inlet
	{
		type wall;
		faces
		(
				(0 16 19 3)
				(3 19 31 15)
		);
	}
	
	outlet
	{
		type wall;
		faces
		(
				(24 8 9 25)
				(25 9 10 26)
		);
	}
	
	ellipse
	{
		type wall;
		faces
		(
			(36 32 33 37)
			(32 36 38 34)
			(39 35 34 38)
			(39 37 33 35)
		);
	}	
	
	topAndBottom
	{
		type wall;
		faces
		(
			//Faces in top			
			(31 30 14 15)
			(30 29 13 14)
			(29 27 11 13)
			(27 26 10 11)
			//Faces in bottom			
			( 0  1 17 16)
			( 1  4 20 17)
			( 4  6 22 20)
			( 6 8  24 22)
		);
	}	
	
	frontAndBack
	{
		type empty;
		faces
		(
			//Faces in back			
			(16 17 18 19)
			(17 20 21 18)
			(20 22 23 21)
			(22 24 25 23)
			(19 18 30 31)
			(18 28 29 30)
			(28 23 27 29)
			(23 25 26 27)
			(18 21 36 37)
			(23 38 36 21)
			(18 37 39 28)
			(23 28 39 38)
			
			//Faces in front
			( 9  7 11 10)
			( 8  6  7  9)
			( 7 12 13 11)
			( 6  4  5  7)
			(12  2 14 13)
			( 4  1  2  5)
			( 2  3 15 14)
			( 1  0  3  2)
			( 7  5 32 34)
			( 2 33 32  5)
			( 2 12 35 33)
			( 7 34 35 12)
		);
	}

  
);

mergePatchPairs
(
);

// ************************************************************************* //
